[
    {
        "company": "Vivid Seats",
        "amount": "2 FREE TICKETS TO ANY EVENT UP TO $500",
        "title": "Weekly Ways to Win",
        "description": "One Prize winner will receive 2 tickets to Any Event from vividseats.com up to $500 total order value (including all taxes and fees). No purchase necessary. Must have or create a free Vivid Seats account and download the Vivid Seats app. Open to U.S. residents only (including DC), 18+ (19+ in ALA/NEB; 21+ in MISS). Limit one entry per person per Daily Contest entry period. Max one Prize winner. VOID WHERE PROHIBITED AND OUTSIDE U.S. Challenges begin at 12:00 am ET on Mondays and end at 11:45 pm ET on Sundays. See Challenge titles for dates within the Vivid Seats app.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Sur La Table",
        "amount": "FREE SHIPPING ON ORDERS OVER $75",
        "title": "Free Shipping on Orders Over $75",
        "description": "Offer applies to ground shipping only for all orders placed on SurLaTable.com or through our catalog and with a merchandise total of $75 or more. Discount will automatically be applied at checkout. Valid for shipments bound to a single destination only within the continental United States. Excludes gift cards, gift wrap, taxes, and prior purchases. Additional shipping charges apply to AK, HI, Puerto Rico, U.S. Virgin Islands and Guam.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 OFF",
        "title": "$15 Off Your Order Over $75 for Joining Texts",
        "description": "Present your code at time of purchase in store or enter code at checkout online to receive this discount. Excludes sale and clearance items, gift cards, prior purchases, and gift-wrap. One-time use only. Cannot be combined with any other offers or discounts. Valid online and in stores. Hard good and cooking class purchases over $75 qualify for free shipping. Additional shipping charges apply to AK, HI, Puerto Rico, U.S. Virgin Islands and Guam.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Burger King",
        "amount": "1¢ with $1+ purchase",
        "title": "Get a Cheeseburger for 1¢ w/ $1+ purchase!",
        "description": "Get a juicy, flame-grilled Cheeseburger for 1¢ with a $1+ purchase—this week only. Available from 4/14/2025 to 4/20/2025 at participating U.S. Burger King® restaurants, only on the BK® App and bk.com for order ahead or dine-in. Must activate Offer in the “Offers” tab on the BK® App or bk.com before placing order. Tax extra. One Offer per Account per day. Not valid with any other coupons or offers and not valid in AK, HI & U.S. territories. Not valid on delivery orders.",
        "expiration_date": "2025-04-20"
    },
    {
        "company": "American Eagle",
        "amount": "30% to 70% off",
        "title": "Ready for Sunshine Sale",
        "description": "30-70% off all AE & Aerie. Exclusions apply. Valid for purchases at AE.com, Aerie.com, or in US (including PR) stores only.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "American Eagle",
        "amount": "30% off",
        "title": "First Purchase Discount",
        "description": "Take 30% off your first AE or Aerie purchase when you use your Real Rewards credit card. Discount code for online will be provided upon credit approval. Valid for purchases at AE.com, Aerie.com or in US (including PR) stores only.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "American Eagle",
        "amount": "30% off",
        "title": "All Jeans & Joggers",
        "description": "30% off all jeans & joggers. Exclusions apply.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "American Eagle",
        "amount": "Free $25 E-Gift Card",
        "title": "Gift Card Promotion",
        "description": "Get a free $25 E-Gift Card when you spend $75+ on gift cards. Free e-gift card valid from 4/22/25 through 5/19/25 and will be sent via email within 1-2 days after order is placed.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "American Eagle",
        "amount": "15% off",
        "title": "Text Sign-Up Discount",
        "description": "Sign up for texts and get 15% off your next AE purchase. Text 'REALTEXT' to 32453. Limited time only. Valid for new subscribers only. Message and data rates may apply.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Sur La Table",
        "amount": "Up to 60% off",
        "title": "Semi-Annual Cookware Sale - Up to 60% Off",
        "description": "Get up to 60% off on top brands like Le Creuset, All-Clad, and Staub during the Semi-Annual Cookware Sale. Available for online and in-store purchases.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Sur La Table",
        "amount": "Free Shipping",
        "title": "Free Shipping on Orders Over $75",
        "description": "Receive free ground shipping on orders over $75 placed on SurLaTable.com or through the catalog. Offer applies to shipments within the continental United States.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 off",
        "title": "$15 Off Your Order Over $75 for Joining Texts",
        "description": "Present your code at the time of purchase in-store or enter the code at checkout online to receive this discount. Excludes sale and clearance items, gift cards, and prior purchases.",
        "expiration_date": "2025-04-22"
    },
    {
        "company": "Oral-B",
        "amount": "$50 Off",
        "title": "Twin Pack Sale",
        "description": "Save $50 on the Genius X Twin Pack. Includes 6 Smart Modes and Smart Pressure Sensor for real-time feedback. Originally priced at $169.99, now available for $119.99. Buy now.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Oral-B",
        "amount": "$20 Off",
        "title": "Vitality Limited Twin Pack",
        "description": "Save $20 on the Vitality Limited Twin Pack. Includes 2-Minute In-handle Timer and Charging Station. Originally priced at $99.99, now available for $79.99. Buy now.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Oral-B",
        "amount": "20% Off",
        "title": "Replacement Brush Heads Subscription",
        "description": "Subscribe & save 20% on replacement brush heads. Sign up for texts and receive exclusive deals, recommendations, and more. Free standard shipping included.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Up to 30% off",
        "title": "Small Appliances, Big Savings",
        "description": "Up to 30% off on Zwilling Electrics, Cuisinart Small Appliances, All-Clad Small Appliances. Shop now for discounts on these brands.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Up to 35% off",
        "title": "Anova Sous Vide Cooking",
        "description": "Up to 35% off on Anova Sous Vide Cooking appliances. Shop now to avail the discount.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 off",
        "title": "$15 OFF YOUR ORDER OVER $75 FOR JOINING TEXTS",
        "description": "Present your code at time of purchase in store or enter code at checkout online to receive this discount. Excludes sale and clearance items, gift cards, prior purchases and gift-wrap. Valid online and in stores. Hard good and cooking class purchases over $75 qualify for free shipping.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Free shipping on orders over $75",
        "title": "Free Shipping Offer",
        "description": "Offer applies to ground shipping for merchandise totals of $75 or more. Discount applied automatically at checkout. Valid for shipments within the continental US. Excludes AK, HI, Puerto Rico, U.S. Virgin Islands, and Guam.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "FREE SHIPPING",
        "title": "Free Shipping on Orders Over $75",
        "description": "Offer applies to ground shipping only for all orders placed on SurLaTable.com or through our catalog with a merchandise total of $75 or more. Discount automatically applied at checkout. Valid for shipments bound to a single destination within the continental U.S. Additional charges apply to AK, HI, Puerto Rico, U.S. Virgin Islands, and Guam. Not applicable to gift cards, gift wrap, or taxes.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 OFF",
        "title": "$15 Off Your Order Over $75",
        "description": "Present your code at time of purchase in-store or enter code at checkout online to receive $15 off. Excludes sale and clearance items, gift cards, and gift-wrap. One-time use only, cannot be combined with other offers. Valid online and in stores within the continental U.S. Free shipping applies to qualifying purchases.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Up to 60% Off",
        "title": "Semi-Annual Cookware Sale",
        "description": "Up to 60% off on select cookware during the semi-annual sale. Shop now to avail the discounts.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Burger King",
        "amount": "$3 Croissan'wich® and Sm. Coffee",
        "title": "Morning Monday",
        "description": "A single Croissan'wich and small size coffee for $3 is available for a limited time only at participating U.S. Burger King® restaurants, only on the BK® App and bk.com for order ahead or dine-in with the 6-digit \"My Code\" located in your Account. Price and participation vary. Royal Perks Account required. Must activate offer in the “Offers” tab on the BK® App or bk.com before placing order. Upsizes and modifications at extra cost. Tax extra. No substitutions. Valid during breakfast hours only. Limit one per Account per week. Not valid with any other coupons or offers. Not valid in AK, HI & U.S. territories. Not valid on delivery orders. Royal Perks terms apply.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Up to 60% off",
        "title": "Semi-Annual Cookware Sale",
        "description": "Great deals on brands like Le Creuset, Staub, and more. Shop online and enjoy up to 60% off top brands.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Free shipping on orders over $75",
        "title": "Free Shipping Offer",
        "description": "Offer applies to ground shipping only for orders placed on SurLaTable.com or through our catalog with a merchandise total of $75 or more. Discount applied at checkout.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 off your order over $75",
        "title": "$15 Off for Joining Texts",
        "description": "Present your code at the time of purchase in store or enter code at checkout online to receive this discount. Excludes sale and clearance items, gift cards, and prior purchases.",
        "expiration_date": "2025-04-21"
    },
    {
        "company": "Sur La Table",
        "amount": "Free shipping on orders over $75",
        "title": "Free Shipping Offer",
        "description": "Offer applies to ground shipping only for all orders placed on SurLaTable.com or through our catalog and with a merchandise total of $75 or more. Discount will automatically be applied at checkout. Valid for shipments bound to a single destination only within the continental United States. Gift cards, gift wrap, taxes, and prior purchases do not qualify toward the minimum purchase requirement. Rush shipping and vendor shipping surcharges still apply. Additional shipping charges apply to AK, HI, Puerto Rico, U.S. Virgin Islands, and Guam. No adjustments to prior purchases.",
        "expiration_date": "2025-04-20"
    },
    {
        "company": "Sur La Table",
        "amount": "$15 off your order over $75 for joining texts",
        "title": "$15 Off Text Sign-Up Offer",
        "description": "Present your code at time of purchase in store or enter code at checkout online to receive this discount. Excludes sale and clearance items, gift cards, prior purchases, and gift-wrap. One-time use only. Cannot be combined with any other offers or discounts. Not redeemable for cash. Valid online and in stores. Hard good and cooking class purchases over $75 qualify for free shipping. Rush shipping and vendor shipping surcharges still apply. Other restrictions may apply. Additional shipping charges apply to AK, HI, Puerto Rico, U.S. Virgin Islands, and Guam.",
        "expiration_date": "2025-04-20"
    },
    {
        "company": "Target",
        "amount": "$10",
        "title": "Easter Meal Savings",
        "description": "Save $10 when you spend $50 on food & beverages for your Easter meal. Activate your personalized Target Circle Bonuses now.",
        "expiration_date": "2025-04-20"
    },
    {
        "company": "Target",
        "amount": "10%",
        "title": "Pet Care Discount",
        "description": "Enjoy 10% off pet care items. Explore this week’s top deals.",
        "expiration_date": "2025-04-20"
    }
]